MISC/2023-03-13-plan-for-revised-version.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-13 Mon 16:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>改訂版で行いたいこと</title>
<meta name="author" content="和田勇" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">改訂版で行いたいこと</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org66e85ba">1. 目的</a></li>
<li><a href="#orgd0421d1">2. チェック項目</a></li>
<li><a href="#org681c120">3. 初期設定</a>
<ul>
<li><a href="#org66bcb64">3.1. 現在存在する EDIT ディレクトリの保存</a></li>
<li><a href="#orgae91c47">3.2. 作業ディレクトリの作成他</a></li>
</ul>
</li>
<li><a href="#org8991fb2">4. 日々の作業（前日作業の確認)</a></li>
<li><a href="#orgf05c849">5. 日々の作業（チェック＆修正）</a></li>
<li><a href="#org0180391">6. ツールの使い方</a>
<ul>
<li><a href="#orgc99bfa1">6.1. ripgrep</a></li>
<li><a href="#org7b8934d">6.2. diff-pdf</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org66e85ba" class="outline-2">
<h2 id="org66e85ba"><span class="section-number-2">1.</span> 目的</h2>
<div class="outline-text-2" id="text-1">
<p>
当初は、一人の作曲家だけなので、えぃやとざっくり変換していましたが、多
くのデータを対象にすると、色々と不都合が出てきます。その不都合部分を、
手動で直すか、一律的にスクリプトで対応ができるかの情報を収集したいと考
えています。
</p>

<p>
対象のファイルも多数あるので、一つ一つこまめに記録してゆく作業は面倒な
ので、git も利用しようと思います。幸いというか、和田が改訂版のスクリプ
トの出来具合を把握するために git 環境を各作曲家毎に設置してあるのでそ
れを利用しようと思います。
</p>

<p>
その手順をこの文章に書きたいと思います。
</p>
</div>
</div>

<div id="outline-container-orgd0421d1" class="outline-2">
<h2 id="orgd0421d1"><span class="section-number-2">2.</span> チェック項目</h2>
<div class="outline-text-2" id="text-2">
<p>
基本的には、ざぁーと　PDF を見ていただいて、気になるところがあれば、報
告していただきたいのですが &#x2026;
</p>

<p>
「表紙をもっとかっこよく」とか「表題部分のレイアウトについて」等々全体
に関わる問題は、編集を伴わないので、git では無理なので、今まで通りメー
ルで行いましょう。
</p>

<p>
そのほかは、各作品毎順次 PDF と Web ページ、時にお手元の書籍類を比較し
ておかしなところを探していただけたらと思います。
</p>

<p>
今の所、ざっくり把握しているのは、改訂版では、インデントに利用していた
と思われる行頭のスペースの取り出し、反映しています。そのため、フレーズ
自体が全体的に右寄りになったりしています。また原文ではインデントされて
いるのに訳文では行われていないものなどもあります。
</p>

<p>
で、見つけたおかしなものは直接ファイルを変更してください。
</p>

<p>
本来、変更したら、できるだけ小さな変更粒度でコミットしていただきたいの
ですが、当分は、「おやすみ」のサイン代わりにその日の作業終了時にコミッ
トしていただければと思います。
</p>
</div>
</div>

<div id="outline-container-org681c120" class="outline-2">
<h2 id="org681c120"><span class="section-number-2">3.</span> 初期設定</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org66bcb64" class="outline-3">
<h3 id="org66bcb64"><span class="section-number-3">3.1.</span> 現在存在する EDIT ディレクトリの保存</h3>
<div class="outline-text-3" id="text-3-1">
<p>
ブラームスのように既に追加した方が良いと判断して修正を加えたものがある
ので、後ほど、改訂班の方にも反映したいので日付付きリネームしておいてく
ださい。
</p>

<div class="org-src-container">
<pre class="src src-shell">mv EDIT EDIT-2023-03-13
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae91c47" class="outline-3">
<h3 id="orgae91c47"><span class="section-number-3">3.2.</span> 作業ディレクトリの作成他</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>作業ディレクトリを作成</li>
<li>ブラームス関連のディレクトリやファイルを作業ディレクトリへ移動</li>
<li>スタイルファイルもコピー</li>
<li>EDIT\Brahms へ移動し git 関連作業
<ul class="org-ul">
<li>作業開始を宣言</li>
<li>手動作業用ブランチ phase-1 を作成しブランチを切り替える</li>
</ul></li>
<li>和田用に Brahms 以下を zip でアーカイブしメールで送ってください</li>
</ol>

<div class="org-src-container">
<pre class="src src-shell">mkdir EDIT
mv Brahms* EDIT
cp -r sty  EDIT
<span style="color: #DCDCCC; font-weight: bold;">cd</span> EDIT\Brahms
git commit -am <span style="color: #CC9393;">"&#25163;&#21205;&#32232;&#38598;&#38283;&#22987;"</span>
git checkout -b phase-1

&#12501;&#12449;&#12452;&#12523;&#12398;&#12452;&#12463;&#12473;&#12503;&#12525;&#12540;&#12521;&#31561;&#12391; Brahms &#20197;&#19979;&#12434; zip &#12391;&#32399;&#12417;&#12390;&#12289;&#21644;&#30000;&#12395;&#12513;&#12540;&#12523;&#12375;&#12390;
&#12367;&#12384;&#12373;&#12356;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8991fb2" class="outline-2">
<h2 id="org8991fb2"><span class="section-number-2">4.</span> 日々の作業（前日作業の確認)</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>前日作成した pdf をリネーム</li>
<li>和田からの追加修正情報をパッチとして受け取ってたら git apply で更新</li>
<li>llmk で pdf を作成
<ul class="org-ul">
<li>エラーが無くなるまで、修正しては再度 llmk の作業を繰り返す
<ul class="org-ul">
<li>もちろん自己解決を諦めて和田に振って、 pdf の比較作業をスキップ
してもも良いです。</li>
</ul></li>
</ul></li>
<li><p>
リネームした pdf とできたばかりの比較
</p>

<p>
ページ数が沢山あるので便利ツールの diffpdf (*1) というアプリを使いましょう。
</p>

<p>
(*1) 別項に記述した URL のページで diffpdf とはどんなものか見ておいてください。
</p>

<ul class="org-ul">
<li>diffpdf を利用して前日のものと比較して妥当か否かチェック</li>
<li>修正ミス等があれば直接ファイルを編集してください
<ul class="org-ul">
<li>必要に応じて llmk で再度 pdf を作っても良いのですが、時間を要す
るので pdf 再作成は翌日朝に先延ばしを原則にしましょう</li>
</ul></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgf05c849" class="outline-2">
<h2 id="orgf05c849"><span class="section-number-2">5.</span> 日々の作業（チェック＆修正）</h2>
<div class="outline-text-2" id="text-5">
<p>
前日チェックした次から、PDF Web ページ、お手持ちの資料を比較検討し、お
かしなところを見つけたら、直接ファイルを直してください。
</p>

<ol class="org-ol">
<li>ファイルの探し方は別項に記述した「ripgrep」を使うとファイル名も一緒
に表示してくれるのでそれを目安にしてください。</li>
<li>探すディレクトリは lyricssongs\EDIT\Brahms です。</li>
<li>エディタは使い慣れたもので結構です。</li>
<li>本来は、修正の都度、変更した理由などをコミットメッセージに含めたも
のをコミットしますが、不慣れだと思うので、しばらくはファイルの中に
latex の ％ で始まるコメントとして必要なら記入しておいてください</li>
<li><p>
不慣れだとはいえ、一日一回は「疲れた、おやすみ」のサイン代わりに
commit し git show でパッチを作成し和田にメールで送りつけてください
</p>

<pre class="example">
EDIT\Brahms のディレクトリで行ってください

git commit -am '2023-xx-yy 作業結果'
git show &gt; 2023-xx-yy-Brams.patch

# 2023-xx-yy-Brams.patch はメール送信後は不要なので削除してください
</pre>

<ul class="org-ul">
<li>和田は、受け取った diff 内容から以下の検討を行う
<ul class="org-ul">
<li>関連する修正の有無</li>
<li>次の作曲者用にスクリプトに組み込むべきか検討</li>
</ul></li>
<li>必要に応じて追加修正パッチを作成</li>
<li>検査結果及び追加パッチを必要に応じて明朝までにメールで回答</li>
</ul></li>
<li>コミットログに都度コミットしたくなったら申し出てください</li>
</ol>
</div>
</div>

<div id="outline-container-org0180391" class="outline-2">
<h2 id="org0180391"><span class="section-number-2">6.</span> ツールの使い方</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgc99bfa1" class="outline-3">
<h3 id="orgc99bfa1"><span class="section-number-3">6.1.</span> ripgrep</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li><p>
基本形
</p>
<pre class="example">
cd 検索したいディレクトリ

rg 検索したい文字列
</pre></li>

<li><p>
or 検索
</p>
<pre class="example">
rg -e 検索したい文字列1 -e 検索したい文字列2
</pre></li>
<li><p>
and 検索
</p>
<pre class="example">
rg '検索したい文字列1.*検索したい文字列'
</pre></li>
<li>比較的よく使うオプション
<ul class="org-ul">
<li>-i &#x2026; ignore case &#x2026; 大文字、小文字関係なしに検索</li>
<li>-l &#x2026; ファイル名のみ表示</li>
<li>-A n / -B n / -C n
<ul class="org-ul">
<li>検索したい文字列の前後を調べるとき、組み合わせも可能</li>
<li>-A &#x2026; after  検索した行とその下 n 行</li>
<li>-B &#x2026; before 検索した行とその上 n 行</li>
<li>-C &#x2026; center 検索した行とその上下 n 行</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7b8934d" class="outline-3">
<h3 id="org7b8934d"><span class="section-number-3">6.2.</span> diff-pdf</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>sccop install diffpdf でインストール
<ul class="org-ul">
<li>類似の diff-pdf もあるけど windows の場合は diffpdf の方が良いように思う</li>
</ul></li>
<li>利用方法は <a href="https://www.gigafree.net/tool/pdf/diffpdf.html">https://www.gigafree.net/tool/pdf/diffpdf.html</a> を参考にしてください</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 和田勇</p>
<p class="date">Created: 2023-03-13 Mon 16:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>